Revit 2024 API
ImageTypeStatus Enumeration
 Indicates the current state of the contents of the ImageType.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Since: 2021
Syntax
C#
public enum ImageTypeStatus
Visual Basic
Public Enumeration ImageTypeStatus
Visual C++
public enum class ImageTypeStatus
Members
Member name | Description
Unknown |  The linked image has not yet been loaded. No image is available. This status is only returned before the document is fully opened.
Loaded |  The linked image was successfully loaded.
FailedToLoad
The linked image could not be loaded from file.
 Some possible reasons are:
The file could not be found
The file could be corrupt or not contain image data
In case of PDF files, the file might be encrypted or not have the requested page
Unloaded |  The linked images was unloaded by the user. No image is available.
Imported |  The image was imported and is available.
Generated |  The internally created image is available.
See Also
Autodesk.Revit.DB Namespace